

{
    "post": [
        {
            "id": "1",
            "title": "Virtualization",
            "subtitle": "Build And Test Your App on Open Source",
            "avatar": "./assets/images/1/virtualization.png",
            "intro": "Virtualization technology enables Cloud providers to efficiently use their computing services and resources. Even if the benefits in terms of performance, maintenance, and cost are evident, however, virtualization has also been exploited by attackers to devise new ways to compromise a system.",
            "content": [
                {
                    "tab": "Overview",
                    "content": "Virtualization was developed in the 1970s as a way to run legacy software on newer mainframe hardware. The new systems being developed did not have an identical architecture to older ones, so they could not run applications from older systems without modification. Virtualization tried to solve this problem by creating an interface within the system that would mimic the behavior of the legacy system being reproduced. Virtualization can also be used to provide isolated containers within which to run an application, or even a full \"virtual machine\" composed of an operating system and all of its applications. Recently services of cloud computing is been utilized on a large scale.Likewise data centers composed of thousands of computers meanwhile the purpose of this data centers is to provide services to as many users and host many disparate applications. <p>Virtualization can be performed in different ways. Emulation attempts to completely simulate the hardware which is being mimicked. This means that completely unmodified applications and operating systems can be run within the emulator because they are completely tricked into thinking they are running on the original hardware.Full or Native Virtualization is a step below emulation in that it may not completely emulate the original hardware. A virtual machine is the software being run within the virtual environment, and it is essentially a full virtual computer composed of an operating system and software packages.</p><md-card><center> <image src='./assets/images/1/hv.jpg'></image> </center></md-card><p> Para-virtualization is a system which requires a small number of modifications to be made to the operating system inside each virtual machine in order to be run. By making the operating system aware that it is within a virtual environment, it can be possible to improve the performance of the system. Example: Xen</p> <p>OS-level Virtualization is a simpler technique which allows multiple copies of a single operating system to run simultaneously. This provides some protection between each instance of the OS, but it is typically not as strong as the boundary between virtual machines in para or full virtualization. Examples: Linux Vserver</p> <p>Application Level Virtualization provides a virtual environment for only a single application within an operating system. This is the technique used to run java applications.Virtualization application is now been using which allows applications to run in environments that do not suit the native application.</p><p>Top companies which uses Virtualization are: Microsoft, Citrix, RedHat, Oracle Virtualization,Amazon EC2, ganeti, Odin, Huawei Cloud, Nimboxx </p><p> Future Of Virtualization:Security Abstraction: Detecting Malware at hypervisor level to enhance security of cloud in virtual environment, Hosted/Virtual/Cloud Desktops: People very realized that VDI isn’t as easy as it may seem. Numerous underlying components can make this technology a bit cumbersome, Network Virtualization (SDN and NFV): Also known as software defined networks (SDN), network virtualization has allowed the administrator much greater control over a network infrastructure.User Virtualization. With IT consumerization and mobility making a presence, more organizations have been looking for ways to abstract the user layer from devices, applications and end-points</p>"
                },
                {
                    "tab": "Top Companies Using Virtualization",
                    "content": "<ul> <li> Microsoft </li> <li> Citrix </li> <li> RedHat </li> <li> Oracle Virtualization </li> <li> Amazon EC2 </li> <li> ganeti </li> <li> Odin </li> <li> Huawei cloud </li> <li> Nimboxx </li> </ul>"
                },
                {
                    "tab": "Future Of Virtualization",
                    "content": "<ul><li><em>Security Abstraction : </em></li><p> Detecting Malware at hypervisor level to enhance security of cloud in virtual environment.</p> <li><em>Hosted/Virtual/Cloud Desktops :</em></li> <p> People very realized that VDI isn’t as easy as it may seem. Numerous underlying components can make this technology a bit cumbersome</p> <li><em> Network Virtualization (SDN and NFV) : </em></li> <p>Also known as software defined networks (SDN), network virtualization has allowed the administrator much greater control over a network infrastructure.User Virtualization. With IT consumerization and mobility making a presence, more organizations have been looking for ways to abstract the user layer from devices, applications and end-points</p></ul>"
                }
                ]
        },
        {
            "id": "2",
            "title": "Travis CI",
            "subtitle": "Build And Test Your App on Open Source",
            "avatar": "../../assets/images/travis.png",
            "intro": "Travis CI makes working in a team for a software project easier with automated builds. These builds are triggered automatically when each developer checks in their code to the repository. In this article, we will go through how we can integrate Travis CI easily with our project, which is hosted on Github. With automation, notification and testing in place, we can focus on our coding and creating, while Travis CI does the hard work of continuous integration!",
            "content": [
                {
                    "tab": "Overview",
                    "content": "this is an overview"
                },
                {
                    "tab": "Example",
                    "content": "this is an example"
                }
                
            ]
        }
    ]
}